(
  ; Context map
  {}

  "0"
  "ноль"
  (number 0)

  "1"
  "один"
  (number 1)

  "2"
  "02"
  "два"
  (number 2)

  "3"
  "три"
  "03"
  (number 3)

  "4"
  "четыре"
  "04"
  (number 4)

  "пять"
  "5"
  "05"
  (number 5)

  "33"
  "тридцать три"
  "0033"
  (number 33)
  
  "14"
  "четырнадцать"
  (number 14)
  
  "16"
  "шестнадцать"
  (number 16)

  "17"
  "семнадцать"
  (number 17)

  "18"
  "восемнадцать"
  (number 18)

  "пятьсот двадцать пять"
  "525"
  (number 525)

  "1.1"
  "1.10"
  "01.10"
  "1 точка 1"
  "один точка один"
  (number 1.1)

  "0.77"
  ".77"
  (number 0.77)
  
  "100000"
  "100к"
  "100К"
  (number 100000)
  
  "3М"
  "3000К"
  "3000000"
  (number 3000000)
  
  "1200000"
  "1.2М"
  "1200К"
  ".0012Г"
  (number 1200000)

  "-1200000"
  "минус 1200000"
  "-1.2М"
  "-1200К"
  "-.0012Г"
  (number -1200000)

  ;; 
  ;; Ordinals
  ;; 

  "первый"
  "первая"
  "первое"
  "1ая"
  "1-ая"
  "1ый"
  "1-ый"
  "1ое"
  "1-ое"
  (ordinal 1)

  "четвертый"
  "четвертая"
  "четвертое"
  "4ый"
  "4ая"
  "4ое"
  "4-ый"
  "4-ая"
  "4-ое"
  (ordinal 4)

  "пятнадцатый"
  "15й"
  "15-й"
  (ordinal 15)

  "21й"
  "21-й"
  "двадцать первый"
  (ordinal 21)

  "31ый"
  "31-ый"
  "тридцать первый"
  (ordinal 31)

  "48ое"
  "48-ое"
  "сорок восьмое"
  (ordinal 48)

  "99ый"
  "99-й"  
  "девяносто девятый"
  (ordinal 99)

)

