(
  ; Context map
  {}

  "0"
  "ноль"
  (number 0)

  "1"
  "один"
  (number 1)

  "33"
  "тридцать три"
  "0033"
  (number 33)
  
  "14"
  "четырнадцать"
  (number 14)
  
  "16"
  "шестнадцать"
  (number 16)

  "17"
  "семнадцать"
  (number 17)

  "18"
  "восемнадцать"
  (number 18)

  "пятьсот двадцать пять"
  "525"
  (number 525)

  "1.1"
  "1.10"
  "01.10"
  "1 точка 1"
  "один точка один"
  (number 1.1)

  "0.77"
  ".77"
  (number 0.77)
  
  "100000"
  "100к"
  "100К"
  (number 100000)
  
  "3М"
  "3000К"
  "3000000"
  (number 3000000)
  
  "1200000"
  "1.2М"
  "1200К"
  ".0012Г"
  (number 1200000)

  "-1200000"
  "минус 1200000"
  "-1.2М"
  "-1200К"
  "-.0012Г"
  (number -1200000)

  "четвертый"
  "4ый"
  "4-ый"
  (ordinal 4)

)

