(
  ; Context map
  {}

  "0"
  "သုံည"
  "မရှိ"
  (number 0)

  "1"
  "တစ်"
  "ပထမ"
  (number 1)

  "2"
  "နှစ်"
  "ဒုတိယ"
  (number 2)
  
  "3"
  "သုံး"
  "တတိယ"
  (number 3)

  "33"
  "သုံးဆယ့်သုံး"
  (number 33)
  
  "14"
  "ဆယ့်လေး"
  (number 14)
  
  "17"
  "ဆယ့်ခုနှစ်"
  (number 17)
  
  "200"
  "နှစ်ရာ"
  (number 200)
  
  "102"
  "တစ်ရာ့တစ်"
  (number 102)
  
  "1.1"
  "1.10"
  "01.10"
  (number 1.1)

  "0.77"
  ".77"
  (number 0.77)

  "100,000"
  "100000"
  "100K"
  "100k"
  (number 100000)

  "3M"
  "3000K"
  "3000000"
  "3,000,000"
  (number 3000000)

)