(
  ; Context map
  {}

  "0"
  "אפס"
  (number 0)

  "1"
  "אחד"
  "אחת"
  "יחיד"
  (number 1)

  "2"
  "שתיים"
  "שניים"
  "זוג"
  (number 2)

  "33"
  "שלושים ושלוש"
  "שלושים ושלושה"
  "0033"
  (number 33)
  
  "14"
  "ארבעה עשר"
  "ארבע עשרה"
  (number 14)
  
  "16"
  "ששה עשר"
  "שש עשרה"
  (number 16)

  "17"
  "שבעה עשר"
  "שבע עשרה"
  (number 17)

  "18"
  "שמונה עשר"
  "שמונה עשרה"
  (number 18)

  "1.1"
  "1.10"
  "01.10"
  (number 1.1)

  "0.77"
  ".77"
  (number 0.77)
  
  "100,000"
  "100000"
  (number 100000)
  
  "3000000"
  "3,000,000"
  (number 3000000)
  
  "1,200,000"
  "1200000"
  (number 1200000)

  "- 1,200,000"
  "-1200000"
  "מינוס 1,200,000"
  (number -1200000)

  ; "חמשת אלפים"
  ; (number 5000)

  ; "מאתיים אלף"
  ; (number 200000)

  ; "עשרים ואחת אלף ואחד עשר"
  ; "העשרים ואחת אלף ואחד עשרה"
  ; (number 21011)

  "ארבעה"
  (ordinal 4)
)

