(
  ; Context map
  {}

  "0"
  "صفر"
  (number 0)

  "1"
  "واحد"
  (number 1)

  "33"
  "ثلاثة و ثلاثون"
  (number 33)
  
  "14"
  "أربعة عشر"
  (number 14)
  
  "16"
  "ستة عشر"
  (number 16)

  "17"
  "سبعة عشر"
  (number 17)

  "18"
  "ثمانية عشر"
  (number 18)

  "خمسمائة و خمسة و عشرون"
  "525"
  (number 525)

  "1.1"
  "1.10"
  "01.10"
  "1 فاصلة 1"
  "واحد فاصلة واحد"
  (number 1.1)

  "0.77"
  ".77"
  (number 0.77)


   "الثاني"
  (ordinal 2)
  
  "100000"
  "100 الف"
  (number 100000)

  "10000"
  "10 آلاف"
  (number 10000)

  "3 ملايين" 
  "3000000"
  (number 3000000)

  "-1200000"
  (number -1200000)


)