(
  ; Context map
  {}

  "0"
  "صفر"
  (number 0)

  "1"
  "واحد"
  (number 1)
  
  "4"
  "أربعة"
  (number 4)
  
  
  "6"
  "ستة"
  (number 6)

  "33"
  "ثلاث و ثلاثون"
  (number 33)
  
  "11"
  "إحدى عشرة"
  (number 11)
  
  "12"
  "إثنتى عشر"
  (number 12)
  
  "14"
  "أربع عشر"
  (number 14)
   
  "16"
  "ستة عشر"
  (number 16)

  "17"
  "سبع عشر"
  (number 17)

  "18"
  "ثمان عشرة"
  (number 18)

  "خمسمائة و خمسة و عشرون"
  "525"
  (number 525)
  
  "واحدة و عشرون"
  "21"
  (number 21)
  
  
  "أربعة و عشرون"
  "24"
  (number 24)
  
  
  "ستة و عشرون"
  "26"
  (number 26)

  "1.1"
  "1.10"
  "01.10"
  "1 فاصلة 1"
  "واحد فاصلة واحد"
  (number 1.1)

  "0.77"
  ".77"
  (number 0.77)


   "الثاني"
  (ordinal 2)
  
  "100000"
  "100 الف"
  (number 100000)

  "10000"
  "10 آلاف"
  (number 10000)

  "3 ملايين" 
  "3000000"
  (number 3000000)

  "-1200000"
  (number -1200000)


)