(
  ; Context map
  ; Tuesday Feb 12, 2013 at 4:30am is the "now" for the tests
  {:reference-time (time/local-date-time [2013 2 12 4 30])}

  "现在"
  "此时"
  "此刻"
  "当前"
  (datetime 2013 2 12 4 30 00 - 01)
  
  "今天"
  (datetime 2013 2 12 - 13)

  "昨天"
  (datetime 2013 2 11 - 12)

  "明天"
  (datetime 2013 2 13 - 14)

  "后天"
  (datetime 2013 2 14 - 15)
  
  "前天"
  (datetime 2013 2 10 - 11)

  "星期一"
  "礼拜一"
  "周一"
  (datetime 2013 2 18 - 19)

  "星期二"
  "礼拜二"
  "周二"
  (datetime 2013 2 19 - 20)

  "星期三"
  "礼拜三"
  "周三"
  (datetime 2013 2 13 - 14)

  "星期四"
  "礼拜四"
  "周四"
  (datetime 2013 2 14 - 15)

  "星期五"
  "礼拜五"
  "周五"
  (datetime 2013 2 15 - 16)

  "星期六"
  "礼拜六"
  "周六"
  (datetime 2013 2 16 - 17)

  "星期日"
  "星期天"
  "礼拜天"
  "周日"
  (datetime 2013 2 17 - 18)

  "这周末"
  (datetime 2013 2 15 18 - 18 0)

  "周一早上"
  "周一早晨"
  "礼拜一早上"
  "礼拜一早晨"
  (datetime 2013 2 18 4 00 - 12 00)

  "上周日"
  "上星期天"
  "上礼拜天"
  (datetime 2013 2 10 - 11)

  "周日, 二月十号"
  "星期天, 二月十号"
  "礼拜天, 二月十号"
  (datetime 2019 2 10 - 11) ; with current look-forward default...

  "上周二"
  "上礼拜二"
  (datetime 2013 2 5 - 6)

  "三月一号"
  "三月一日"
  (datetime 2013 3 1 - 2)

  "2015年3月3号"
  "2015年3月三号"
  "2015年三月3号"
  "2015年三月三号"
  "3/3/2015"
  "3/3/15"
  "2015-3-3"
  "2015-03-03"
  (datetime 2015 3 3 - 4)

  "2013年2月15号"
  "2013年二月十五号"
  "2月15号"
  "二月十五号"
  "2/15"
  (datetime 2013 2 15 - 16)
  
  "10/31/1974"
  "10/31/74"
  (datetime 1974 10 31 - 11 1)

  "二月十五号早上"
  "二月十五号早晨"
  "2月15号早上"
  "2月15号早晨"
  (datetime 2013 2 15 4 - 12)

  "下周二" ; when today is Tuesday, "mardi prochain" is a week from now
  "这礼拜二"
  (datetime 2013 2 19 - 20)

  "这周三" ; when today is Tuesday, "mercredi prochain" is tomorrow
  "这礼拜三"
  (datetime 2013 2 13 - 14)

  "下周三"
  "下礼拜三"
  (datetime 2013 2 13 - 14)

  "这周一"
  "这礼拜一"
  (datetime 2013 2 18 - 19)

  "这周二"
  "这礼拜二"
  (datetime 2013 2 19 - 20)

  "这周"
  "这一周"
  "这礼拜"
  "这一礼拜"
  (datetime 2013 2 11 - 18)
  
  "上周"
  (datetime 2013 2 4 - 11)
  
  "下周"
  (datetime 2013 2 18 - 25)
  
  "上月"
  "上个月"
  (datetime 2013 1 - 2)

  "下月"
  "下个月"
  (datetime 2013 3 - 4)
  
  "去年"
  (datetime 2012 - 2013)
  
  "今年"
  "这一年"
  (datetime 2013 - 2014)
  
  "明年"
  (datetime 2014 - 2015)
  
  "上两秒"
  "上二秒"
  "前两秒"
  "前二秒"
  (datetime 2013 2 12 4 29 58 - 4 30 0)

  "下三秒"
  "后三秒"
  (datetime 2013 2 12 4 30 01 - 04)

  "上两分钟"
  "上二分钟"
  "前两分钟"
  "前二分钟"
  (datetime 2013 2 12 4 28 - 30)

  "下三分钟"
  "后三分钟"
  (datetime 2013 2 12 4 31 - 34)

  "上两小时"
  "上二小时"
  "前两小时"
  "前二小时"
  (datetime 2013 2 12 2 - 4)

  "下三小时"
  "后三小时"
  (datetime 2013 2 12 5 - 8)

  "上两天"
  "前两天"
  (datetime 2013 2 10 - 12)

  "下三天"
  "后三天"
  (datetime 2013 2 13 - 16)
    
  "上两周"
  "上二周"
  (datetime 2013 1 28 - 2 11)

  "下三周"
  "下三个周"
  (datetime 2013 2 18 - 3 11)

  "上两个月"
  "上二个月"
  "上二月"
  "前两个月"
  "前二个月"
  "前两月"
  (datetime 2012 12 1 - 2013 2 1)

  "下三个月"
  "后三个月"
  (datetime 2013 3 1 - 6 1)

  "前两年"
  (datetime 2011 - 2013)
  
  "下三年"
  (datetime 2014 - 2017)
  
  "三点"
  "3pm"
  (datetime 2013 2 12 15 - 16)

  "下午三点十五"
  "下午3:15"
  "15:15"
  "3:15pm"
  "3:15PM"
  "3:15p"
  (datetime 2013 2 12 15 15 - 16)

  "下午三点二十分"
  "下午3:20"
  "3:20p"
  (datetime 2013 2 12 15 20 - 21)

  "下午三点半"
  "15:30"
  "3:30pm"
  "3:30PM"
  (datetime 2013 2 12 15 30 - 31)

  "中午差一刻"
  "中午差十五分钟"
  "十二点差一刻"
  "十二点差十五分钟"
  "11:45am"
  (datetime 2013 2 12 11 45 - 46)
  
  "九月二十号7:30 PM"
  (datetime 2013 9 20 19 30 - 31)
  
  "周六9am"
  "周六早上9点"
  "周六早上九点"
  (datetime 2013 2 16 9 - 10)
  
  "今晚"
  (datetime 2013 2 12 18 - 13 00)

  "明晚"
  "周三晚上"
  "明天晚上"
  (datetime 2013 2 13 18 - 14 00)
  
  "昨晚"
  "昨天晚上"
  (datetime 2013 2 11 18 - 12 00)
  
  "再一秒"
  (datetime 2013 2 12 4 30 1 - 2)
  
  "再一分钟"
  (datetime 2013 2 12 4 31 - 32)
  
  "再两分钟"
  (datetime 2013 2 12 4 32 - 33)
  
  "再六十分钟"
  (datetime 2013 2 12 5 30 - 31)
  
  "再一小时"
  (datetime 2013 2 12 5 30 - 6 30)

  "再二十四小时"
  (datetime 2013 2 13 4 30 - 5 30)
  
  "再一天"
  (datetime 2013 2 13 4 30 - 14 4 30)

  "再七天"
  (datetime 2013 2 19 4 30 - 20 4 30)

  "再一周"
  "再一礼拜"
  (datetime 2013 2 19 4 30 - 26 4 30)

  "七天前"
  (datetime 2013 2 5 4 30 - 6 4 30)
  
  "一周前"
  "一礼拜前"
  (datetime 2013 2 5 4 30 - 12 4 30)

  "三周前"
  "三礼拜前"
  (datetime 2013 1 22 4 30 - 29 4 30)
  
  "三个月前"
  (datetime 2012 11 12 4 30 - 12 12 4 30)

  "两年前"
  (datetime 2011 2 12 4 30 - 2012 2 12 4 30)
  
  "4pm PST"
  (datetime-withzone "PST" 2013 2 12 16 - 17)

  "2015年4月14号"
  (datetime 2015 4 14 - 15)

  "今晚8点"
  "今晚八点"
  (datetime 2013 2 12 20 - 21)
)