(
 ; Context map
 {}

 "0"
 "영"
 "빵"
 "공"
 (number 0)

 "1"
 "일"
 "하나"
 "한"
 (number 1)

 "10"
 "십"
 "열"
 (number 10)

 "11"
 "십일"
 "열하나"
 "십하나"
 "열한"
 (number 11)

 "20"
 "이십"
 "스물"
 (number 20)

 "35"
 "삼십오"
 "서른다섯"
 (number 35)

 "47"
 "사십칠"
 "마흔일곱"
 (number 47)

 "52"
 "오십이"
 "쉰둘"
 "쉰두"
 (number 52)

 "69"
 "육십구"
 "예순아홉"
 (number 69)

 "71"
 "칠십일"
 "일흔하나"
 "일흔한"
 (number 71)

 "84"
 "팔십사"
 "여든넷"
 (number 84)

 "93"
 "구십삼"
 "아흔셋"
 (number 93)

 "100"
 "백"
 (number 100)

 "123"
 "백이십삼"
 (number 123)

 "579"
 "오백칠십구"
 (number 579)

 "1000"
 "천"
 (number 1000)

 "1723"
 "천칠백이십삼"
 (number 1723)

 "5619"
 "오천육백십구"
 (number 5619)

 "10000"
 "만"
 "일만"
 (number 10000)

 "12345"
 "만이천삼백사십오"
 "일만이천삼백사십오"
 (number 12345)

 "58194"
 "오만팔천백구십사"
 (number 58194)

 "581900"
 "오십팔만천구백"
 (number 581900)

 "5819014"
 "오백팔십일만구천십사"
 (number 5819014)

 "58190148"
 "오천팔백십구만백사십팔"
 (number 58190148)

 "100000000"
 "일억"
 (number 100000000)

 "274500000000"
 "이천칠백사십오억"
 (number 274500000000)

 "100000002"
 "일억이"
 (number 100000002)

 "27350000"
 "이천칠백삼십오만"
 (number 27350000)

 "3235698120"
 "삼십이억삼천오백육십구만팔천백이십"
 (number 3235698120)

 "40234985729"
 "사백이억삼천사백구십팔만오천칠백이십구"
 (number 40234985729)

 "701239801123"
 "칠천십이억삼천구백팔십만천백이십삼"
 (number 701239801123)

 "3.4"
 "삼점사"
 (number 3.4)

 "4123.3"
 "사천백이십삼점삼"
 (number 4123.3)

 "일점이삼"
 (number 1.23)

 "-3"
 "마이너스3"
 "마이너스삼"
 "마이너스 3"
 "마이나스3"
 "마이나스 3"
 (number -3)

 "3/4"
 "사분의삼"
 (number 3/4)

 "스물다섯번째"
 "이십오번째"
 (ordinal 25)

 "첫번째"
 "첫째"
 (ordinal 1)

)
