(
  ; Context map
  {}

  "0"
  "нуль"
  (number 0)

  "1"
  "один"
  (number 1)

  "2"
  "02"
  "два"
  (number 2)

  "3"
  "три"
  "03"
  (number 3)

  "4"
  "чотири"
  "04"
  (number 4)

  "п‘ять"
  "5"
  "05"
  (number 5)

  "33"
  "тридцять три"
  "0033"
  (number 33)

  "14"
  "чотирнадцять"
  (number 14)

  "16"
  "шістнадцять"
  (number 16)

  "17"
  "сімнадцять"
  (number 17)

  "18"
  "вісімнадцять"
  (number 18)

  "п‘ятсот двадцять п‘ять"
  "525"
  (number 525)

  "1.1"
  "1.10"
  "01.10"
  "1 крапка 1"
  "один крапка один"
  (number 1.1)

  "0.77"
  ".77"
  (number 0.77)

  "100000"
  "100к"
  "100К"
  (number 100000)

  "3М"
  "3000К"
  "3000000"
  (number 3000000)

  "1200000"
  "1.2М"
  "1200К"
  ".0012Г"
  (number 1200000)

  "-1200000"
  "мінус 1200000"
  "-1.2М"
  "-1200К"
  "-.0012Г"
  (number -1200000)

  ;;
  ;; Ordinals
  ;;

  "перший"
  "перша"
  "перше"
  "1а"
  "1-а"
  "1ий"
  "1-ий"
  "1е"
  "1-е"
  (ordinal 1)

  "четвертий"
  "четверта"
  "четверте"
  "4ий"
  "4а"
  "4е"
  "4-ий"
  "4-а"
  "4-е"
  (ordinal 4)

  "п‘ятнадцятий"
  "15й"
  "15-й"
  (ordinal 15)

  "21й"
  "21-й"
  "двадцять перший"
  (ordinal 21)

  "31ий"
  "31-ий"
  "тридцять перший"
  (ordinal 31)

  "48е"
  "48-е"
  "сорок восьме"
  (ordinal 48)

  "99ий"
  "99-й"
  "дев‘яносто дев‘ятий"
  (ordinal 99)

  )

