(
  ; Context map
  {}

  "0"
  "ゼロ"
  "零"
  (number 0)

  "1"
  "一"
  (number 1)

  "33"
  "三十三"
  "0033"
  (number 33)
  
  "14"
  "十四"
  (number 14)
  
  "16"
  "十六"
  (number 16)

  "17"
  "十七"
  (number 17)

  "18"
  "十八"
  (number 18)

  "100"
  "百"
  (number 100)

  "101"
  "百一"
  (number 101)

  "200"
  (number 200)

  "1.1"
  "1.10"
  "01.10"
  (number 1.1)

  "0.77"
  ".77"
  (number 0.77)
  
  "100,000"
  "100000"
  "100K"
  "100k"
  (number 100000)
  
  "3M"
  "3000K"
  "3000000"
  "3,000,000"
  (number 3000000)
  
  "1,200,000"
  "1200000"
  "1.2M"
  "1200K"
  ".0012G"
  (number 1200000)

  "- 1,200,000"
  "-1200000"
  "-1.2M"
  "-1200K"
  "-.0012G"
  (number -1200000)

  "5千"
  (number 5000)

  "2万"
  (number 20000)

  "第七"
  (ordinal 7)
)

