(
  ; Context map
  {}

  "0"
  "ศูนย์"
  "๐"
  (number 0)

  "1"
  "หนึ่ง"
  "เอ็ด"
  "๑"
  (number 1)

  "2"
  "สอง"
  "ยี่"
  "๒"
  (number 2)

  "3"
  "สาม"
  "๓"
  (number 3)

  "10"
  "สิบ"
  "๑๐"
  (number 10)

  "11"
  "สิบเอ็ด"
  "๑๑"
  (number 11)

  "20"
  "ยี่สิบ"
  "๒๐"
  (number 20)

  "21"
  "ยี่สิบเอ็ด"
  "๒๑"
  (number 21)

  "33"
  "สามสิบสาม"
  "๓๓"
  (number 33)

  "100"
  "หนึ่งร้อย"
  "ร้อย"
  "๑๐๐"
  (number 100)

  "102"
  "หนึ่งร้อยสอง"
  "๑๐๒"
  (number 102)

  "หนึ่งร้อยยี่สิบ"
  "ร้อยยี่สิบ"
  "120"
  "๑๒๐"
  (number 120)
)
